import json
from pathlib import Path

# Словарь.
definitions = {
    'человек': 'общественное существо, обладающее наиболее развитым среди известных биологических'
    '\n видов интеллектом и сознанием. По научным данным, возник на Земле в результате эволюционного'
    '\n процесса - антропогенеза, детали которого продолжают изучаться.',
            
    'животное': 'это многоклеточный эукариотический организм, который питается органическими веществами'
    '\n и обычно способен к передвижению, в отличие от растений',  
    
    'собака': 'это домашнее животное, одно из наиболее популярных животных-компаньенов.\n'
    'С зоологической точки зрения, собака - плацентарное млекопитающее отряда хищных семейств',
            
    'кошка': 'это домашнее животное, одно из наиболее популярных животных-компаньенов \n'
    'которое может мяукать и много спать. С точки зрения научной систематики, домашняя кошка -'
    '\nмлекопитающее семейства кошачьих отряда хищных.',
            
    'попугай': 'это птица которая умеет повторять слова и петь. Существует огромное разнообразие'
    '\nвидов попугаев, насчитывающее сотни, если не тысячи, различных подвидов и разновидностей.',
            
    'компьютер': 'это электронное устройство для автоматической обработки, хранения и передачи информации под'
    '\n программ. Он выполняет вычисления, логические операции и другие задачи без прямого участия человека.',
            
    'гитара': 'представляет собой универсальный и многофункциональный музыкальный инструмент, который'
    '\nотличается компактностью и способностью охватывать широкий спектр музыкальных стилей и техник.',
            
    'телефон': 'система технических приспособлений для передачи звуков на расстояние по проводам при помощи'
    '\n электрической энергии. Телефон это аппарат для разговора таким способом.',
            
    'телевизор': 'приёмник телевизионных сигналов изображения и звука, отображающий их на экране и с помошью динамиков',
    }

# Список.
filters = [
            'что', 'такое', 'зачем', 'для', 'чего', 'как', 'почему', 'когда', 'насколько',
            'зовут', 'нибудь','потому', 'стоит', 'ли', 'наиболее', 'наименее', 'во', 'сколько','кто', 'такой', '?',
            '!', 'нужно', 'нужна', 'думаешь', 'делаешь', 'ну', 'вот', 'так', 'и', 'далее', 'т.д', 'интресно','узнать',
            'подумать', 'мыслить', 'мыслишь', 'будет', 'не', 'увлекательно','занимательно', 'это', 'ты', 'такой', 'нужен',
            'делает',
]    

def create_data():
    if not Path('library.json').exists():
        path = Path('library.json')
        contents = json.dumps(definitions)
        path.write_text(contents)
        
    if not Path('filters.json').exists():
        path = Path('fillers.json')
        contents = json.dumps(filters)
        path.write_text(contents)
        
    print('Данные сохранились.')

if __name__ == '__main__':
    create_data()