import random


def random_msg1():
    msgs1 = [
        'Задайте мне какой-нибудь вопрос: ', 'Задайте интересующий вопрос: ',
        'Хотите спросить что нибудь? ', 'Хотите узнать что нибудь от меня? ',
        'Спросите меня о ком или о чем нибудь: ', 'Скажите то что вас интересует: ',
        'Желаете ли узнать что-то или нет? ', 'Вам что нибудь интересно? ',
        'Скажите то что вас интересует и я постораюсь на это ответить если смогу: ',
        'Расскажите то что вам интересно и я постораюсь на это ответить если смогу: ',
        'Спрашивайте не стесняясь: ', 'Спросите то что интересно узнать: ', 'Вопросики? '
            ]
    return random.choice(msgs1)

def random_msg2():
    msgs2 = [
        '\nЖелаете ли продолжить? (да/нет) ', '\nХотите продолжить? (да/нет) ',
        '\nЕсли хотите продолжить напишите (да) если не хотите напишите (нет) ',
        '\nЕсли вам хочется продолжить ответьте (да) если же нет ответьте (нет) ',
        '\nСогласны ли вы продолжить? (да/нет) ', '\nПродолжим? (да/нет) ',
            ]
    return random.choice(msgs2)

def random_msg3():
    msgs3 = [
        'Чтож с вами было интересно поболтать', 'Хорошо, это был интересный разговор',
        'Спасибо, за диалог', 'С вами было весело', 'Буду ждать следующий встрече',
        'Возвращайтесь', 'Спасибо что уделили свое время', 'Спасибо за обратною связь',
        'До встречи',
        ]
    return random.choice(msgs3)

def random_msg4():
    msgs4 = [
        'К сожалению я не знаю что такое', 'Этого я не знаю, поделитесь со мной что такое ',
        'Это слово мне неизвестно, поделитесь со мной что такое ',
        'Было бы интересно узнать что такое ', 'Расскажите мне что такое ',
        'Хотелось бы узнать что такое ', 'Прошу поделитесь со мной информацией об ',
        ]
    return random.choice(msgs4)

def random_msg5():
    msgs5 = [
        'Тогда дайте определение этому слову', 'Тогда что обозначает слово',
        'Интересно узнать что же такое', 'Интересно что это слово значит',
        'Расскажите мне пожалуйста что означает это слово', 'Было бы интересно узнать что такое',
        ]
    return random.choice(msgs5)  

def random_msg6():
    msgs6 = [
        'Спасибо что поделились со мной информацией я ее обязательно не забуду!', 'Спасибо, за обратную связь',
        'Спасибо за инфорамацию', 'Спасибо, постараюсь запомнить', 'Спасибо, следущий раз уже буду знать что это',
        'Спасибо', 'Следующий раз буду знать это и это благодаря вам', 'Было очень познавательно узнать что это',
        'Было очень интересно узнать что это', 'Было очень интересно узнать что это, благодарю за информацию'
        ]
    return random.choice(msgs6)

def random_msg7():
    msgs7 = [
        'Чтож, если захотите поделиться обязательно сообщите', 'Видимо так и останусь в невединии',
        'Чтож, было бы интересно узнать что это', 'Надеюсь когда нибудь узнаю что это такое',
        'Если захотите сообщить возвращайтесь', 'Спасибо за обратную связь'
        ]
    return random.choice(msgs7)